export const quizzes = [
  {
    code: "GEO101",
    title: "Столиці світу",
    category: "Географія",

    difficulty: "Легко",

    hasTimer: true,
    timePerQuestion: 15,

    createdAt: "2026-05-27T10:00:00Z",

    timesPlayed: 0,  

    questions: [
      {
        q: "Яка столиця Франції?",
        answers: ["Берлін", "Париж", "Рим", "Мадрид"],
        correct: 1,
      },
      {
        q: "Яка столиця Німеччини?",
        answers: ["Берлін", "Мадрид", "Бонн", "Париж"],
        correct: 0,
      },      
      {
        q: "Яка столиця Іспанії?",
        answers: ["Барселона", "Відень", "Мадрид", "Будапешт"],
        correct: 2,
      },      
      {
        q: "Яка столиця Угорщини?",
        answers: ["Лондон", "Берлін", "Прага", "Будапешт"],
        correct: 3,
      },      
      {
        q: "Яка столиця Чехії?",
        answers: ["Берлін", "Відень", "Прага", "Братислава"],
        correct: 2,
      },      
      {
        q: "Яка столиця Австрії?",
        answers: ["Відень", "Париж", "Зальцбург", "Будапешт"],
        correct: 0,
      },{
        q: "Яка столиця Бразилії?",
        answers: ["Ріо де Жанейро", "Буенос Айрес", "Бразиліа", "Ботафого"],
        correct: 2,
      },
      {
        q: "Яка столиця Канади?",
        answers: ["Оттава", "Монреаль", "Сіетл", "Вашингтон"],
        correct: 0,
      },      
      {
        q: "Яка столиця Японії?",
        answers: ["Сеул", "Токіо", "Пекін", "Кіото"],
        correct: 1,
      },      
      {
        q: "Яка столиця України?",
        answers: ["Харків", "Дніпро", "Київ", "Запоріжжя"],
        correct: 2,
      },      
      {
        q: "Яка столиця США?",
        answers: ["Ванкувер", "Нью-Йорк", "Лос Анжелес", "Вашингтон"],
        correct: 3,
      },      
      {
        q: "Яка столиця Австралії?",
        answers: ["Канберра", "Сідней", "Відень", "Мельбурн"],
        correct: 0,
      },
    ],
  },

  {
    code: "MATH44",
    title: "Шкільна математика",
    category: "Математика",

    difficulty: "Середньо",

    hasTimer: true,
    timePerQuestion: 20,

    createdAt: "2026-05-26T10:00:00Z",

    timesPlayed: 0,  

    questions: [
    {
      q: "Скільки буде 15 × 6?",
      answers: ["80", "90", "75", "95"],
      correct: 1,
    },
    {
      q: "Чому дорівнює √144?",
      answers: ["10", "14", "12", "16"],
      correct: 2,
    },
    {
      q: "Скільки градусів у сумі кутів трикутника?",
      answers: ["90", "180", "270", "360"],
      correct: 1,
    },
    {
      q: "Розв’яжіть: 3x + 7 = 22",
      answers: ["3", "4", "5", "6"],
      correct: 2,
    },
    {
      q: "Яке число є простим?",
      answers: ["21", "39", "17", "27"],
      correct: 2,
    },
    {
      q: "Скільки буде 2³?",
      answers: ["6", "8", "9", "12"],
      correct: 1,
    },
    {
      q: "Який дріб більший?",
      answers: ["1/2", "3/4", "2/5", "1/3"],
      correct: 1,
    },
    {
      q: "Чому дорівнює площа квадрата зі стороною 7?",
      answers: ["14", "28", "42", "49"],
      correct: 3,
    },
    {
      q: "Скільки буде 25% від 200?",
      answers: ["25", "40", "50", "75"],
      correct: 2,
    },
    {
      q: "Розв’яжіть: 9 + 6 ÷ 3",
      answers: ["5", "11", "15", "7"],
      correct: 1,
    },
    ],
  },

  {
    code: "GEO999",
    title: "Країни світу",
    category: "Географія",

    difficulty: "Складно",

    hasTimer: true,
    timePerQuestion: 10,

    createdAt: "2026-05-26T10:00:00Z",

    timesPlayed: 2,  

    questions: [
    {
      q: "Яка країна має найбільшу кількість часових поясів?",
      answers: ["США", "Росія", "Франція", "Китай"],
      correct: 2,
    },
    {
      q: "Яка столиця Казахстану?",
      answers: ["Алмати", "Ташкент", "Астана", "Бішкек"],
      correct: 2,
    },
    {
      q: "Яка країна не має виходу до моря?",
      answers: ["Португалія", "Болівія", "В’єтнам", "Норвегія"],
      correct: 1,
    },
    {
      q: "Яка країна є найбільшою за площею в Африці?",
      answers: ["Нігерія", "Єгипет", "Алжир", "Судан"],
      correct: 2,
    },
    {
      q: "Яка річка протікає через Будапешт?",
      answers: ["Дунай", "Рейн", "Вісла", "Дніпро"],
      correct: 0,
    },
    {
      q: "Яка країна має найбільше островів у світі?",
      answers: ["Індонезія", "Швеція", "Філіппіни", "Японія"],
      correct: 1,
    },
    {
      q: "Яка столиця Нової Зеландії?",
      answers: ["Окленд", "Крайстчерч", "Веллінгтон", "Гамільтон"],
      correct: 2,
    },
    {
      q: "Яка країна розташована одразу у Європі та Азії?",
      answers: ["Іран", "Туреччина", "Індія", "Єгипет"],
      correct: 1,
    },
    {
      q: "Яка пустеля є найбільшою у світі?",
      answers: ["Сахара", "Гобі", "Антарктична пустеля", "Калахарі"],
      correct: 2,
    },
    {
      q: "Яка країна має форму «чобота»?",
      answers: ["Греція", "Італія", "Іспанія", "Хорватія"],
      correct: 1,
    },
    {
      q: "Яка країна є найменшою у світі?",
      answers: ["Монако", "Сан-Марино", "Ватикан", "Ліхтенштейн"],
      correct: 2,
    },
    {
      q: "Яка столиця Монголії?",
      answers: ["Астана", "Улан-Батор", "Токіо", "Баку"],
      correct: 1,
    },
    {
      q: "Яка країна має найбільше населення в Південній Америці?",
      answers: ["Аргентина", "Колумбія", "Перу", "Бразилія"],
      correct: 3,
    },
    {
      q: "Яка країна першою отримує новий рік?",
      answers: ["Японія", "Нова Зеландія", "Кірібаті", "Австралія"],
      correct: 2,
    },
    {
      q: "Яка країна має найбільшу кількість офіційних мов?",
      answers: ["Індія", "Південна Африка", "Швейцарія", "Болівія"],
      correct: 3,
    },
    ],
  },

  {
    code: "GEO231",
    title: "Європа",
    category: "Географія",

    difficulty: "Середньо",

    hasTimer: false,

    createdAt: "2026-05-26T10:00:00Z",

    timesPlayed: 0,  

    questions: [
    {
      q: "Яка найдовша річка Європи?",
      answers: ["Дунай", "Волга", "Рейн", "Дніпро"],
      correct: 1,
    },
    {
      q: "Яка країна має найбільшу площу в Європі?",
      answers: ["Україна", "Німеччина", "Франція", "Франція"],
      correct: 3,
    },
    {
      q: "Яка столиця Португалії?",
      answers: ["Порту", "Лісабон", "Мадрид", "Барселона"],
      correct: 1,
    },
    {
      q: "Навища гора у Європі?",
      answers: ["Пік Дюфур", "Монблан", "Тейде", "Говерла"],
      correct: 2,
    },
    {
      q: "Яка країна Європи має найбільше населення?",
      answers: ["Франція", "Італія", "Німеччина", "Польща"],
      correct: 2,
    },
    {
      q: "Яка столиця Фінляндії?",
      answers: ["Осло", "Стокгольм", "Гельсінкі", "Рига"],
      correct: 2,
    },
    {
      q: "Яка країна не входить до Скандинавії?",
      answers: ["Норвегія", "Швеція", "Данія", "Фінляндія"],
      correct: 3,
    },
    {
      q: "Яке море омиває південь Італії?",
      answers: ["Балтійське", "Чорне", "Середземне", "Північне"],
      correct: 2,
    },
    {
      q: "Яка столиця Хорватії?",
      answers: ["Любляна", "Загреб", "Белград", "Скоп’є"],
      correct: 1,
    },
    {
      q: "Яка країна має найбільшу кількість сусідів у Європі?",
      answers: ["Німеччина", "Франція", "Австрія", "Польща"],
      correct: 0,
    },
    {
      q: "Який острів є найбільшим у Середземному морі?",
      answers: ["Крит", "Сицилія", "Сардинія", "Кіпр"],
      correct: 1,
    },
    {
      q: "Яка столиця Словаччини?",
      answers: ["Прага", "Будапешт", "Братислава", "Любляна"],
      correct: 2,
    },
    {
      q: "Яка країна Європи має форму «черевика»?",
      answers: ["Іспанія", "Греція", "Італія", "Болгарія"],
      correct: 2,
    },
    {
      q: "Яка протока відділяє Європу від Африки?",
      answers: ["Босфор", "Гібралтарська", "Ла-Манш", "Дарданелли"],
      correct: 1,
    },
    {
      q: "Яка столиця Ісландії?",
      answers: ["Осло", "Копенгаген", "Рейк’явік", "Тронгейм"],
      correct: 2,
    },
    ],
  },

  {
    code: "FTB882",
    title: "Футбольні клуби",
    category: "Спорт",

    difficulty: "Легко",

    hasTimer: false,

    createdAt: "2026-05-27T10:00:00Z",

    timesPlayed: 0,  

    questions: [
    {
      q: "Який клуб називають «королівським»?",
      answers: ["Барселона", "Ювентус", "Реал Мадрид", "Мілан"],
      correct: 2,
    },
    {
      q: "У якому місті базується клуб «Баварія»?",
      answers: ["Берлін", "Дортмунд", "Гамбург", "Мюнхен"],
      correct: 3,
    },
    {
      q: "Який клуб грає на стадіоні «Енфілд»?",
      answers: ["Арсенал", "Ліверпуль", "Челсі", "Тоттенгем"],
      correct: 1,
    },
    {
      q: "Який клуб має прізвисько «Стара синьйора»?",
      answers: ["Інтер", "Рома", "Ювентус", "Наполі"],
      correct: 2,
    },
    {
      q: "Який клуб є головним суперником «Барселони»?",
      answers: ["Атлетіко", "Севілья", "Валенсія", "Реал Мадрид"],
      correct: 3,
    },
    {
      q: "У якій країні грає клуб «ПСЖ»?",
      answers: ["Італія", "Іспанія", "Франція", "Португалія"],
      correct: 2,
    },
    {
      q: "Який клуб грає у жовто-чорних кольорах?",
      answers: ["Боруссія Дортмунд", "Мілан", "Аякс", "Бенфіка"],
      correct: 0,
    },
    {
      q: "Який англійський клуб має прізвисько «каноніри»?",
      answers: ["Челсі", "Манчестер Сіті", "Арсенал", "Евертон"],
      correct: 2,
    },
    {
      q: "Який клуб виграв найбільше Ліг чемпіонів?",
      answers: ["Мілан", "Барселона", "Баварія", "Реал Мадрид"],
      correct: 3,
    },
    {
      q: "У якому місті знаходиться клуб «Манчестер Юнайтед»?",
      answers: ["Лондон", "Манчестер", "Ліверпуль", "Бірмінгем"],
      correct: 1,
    },
    {
      q: "Який клуб грає на стадіоні «Сан-Сіро»?",
      answers: ["Мілан", "Наполі", "Лаціо", "Фіорентина"],
      correct: 0,
    },
    {
      q: "Який клуб називають «синьо-гранатовими»?",
      answers: ["Барселона", "Порту", "Челсі", "Інтер"],
      correct: 0,
    },
    ],
  },
];